In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime

In [2]:
df = pd.read_csv('sales.csv')
display(df.head())
print(df.shape)

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
0,460489604,1/25/2018,16:46,Male,Brookfield,NewYork,Yes,Groceries,30,1,30,Cash,2
1,471006167,3/19/2018,16:48,Female,Water tower,Chicago,Yes,Fashion,35,5,175,Card,3
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
3,487313402,1/22/2018,13:38,Female,Park lane,Dallas,Yes,Sporting,89,4,356,Gpay,1
4,197763430,2/18/2018,15:31,Female,Park lane,Dallas,No,Books,82,5,410,Cash,4

(1000, 13)

In [3]:
df.duplicated().sum()

0

In [4]:
df['Date'] = df['Date'].apply( lambda x : datetime.strptime(x, '%m/%d/%Y').date())

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
Invoice ID    1000 non-null int64
Date          1000 non-null object
Time          1000 non-null object
Gender        1000 non-null object
Location      1000 non-null object
City          1000 non-null object
Member        1000 non-null object
Category      1000 non-null object
Price         1000 non-null int64
Quantity      1000 non-null int64
Total         1000 non-null int64
Payment       1000 non-null object
Rating        1000 non-null int64
dtypes: int64(5), object(8)
memory usage: 101.7+ KB

In [6]:
sale_df = df.copy()
sale_df.head()

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
0,460489604,2018-01-25,16:46,Male,Brookfield,NewYork,Yes,Groceries,30,1,30,Cash,2
1,471006167,2018-03-19,16:48,Female,Water tower,Chicago,Yes,Fashion,35,5,175,Card,3
2,411909258,2018-02-25,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
3,487313402,2018-01-22,13:38,Female,Park lane,Dallas,Yes,Sporting,89,4,356,Gpay,1
4,197763430,2018-02-18,15:31,Female,Park lane,Dallas,No,Books,82,5,410,Cash,4

In [7]:
sale_df['Price'] = sale_df['Price'].astype('float')
sale_df['Quantity'] = sale_df['Quantity'].astype('float')
sale_df['Total'] = sale_df['Total'].astype('float')
sale_df["Date"]=pd.to_datetime(sale_df["Date"],format="%Y-%m-%d")

In [10]:
sale_df["weekday"] = sale_df["Date"].dt.weekday_name
sale_df.head()

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating,weekday
0,460489604,2018-01-25,16:46,Male,Brookfield,NewYork,Yes,Groceries,30.0,1.0,30.0,Cash,2,Thursday
1,471006167,2018-03-19,16:48,Female,Water tower,Chicago,Yes,Fashion,35.0,5.0,175.0,Card,3,Monday
2,411909258,2018-02-25,13:33,Male,Water tower,Chicago,No,Clothing,57.0,2.0,114.0,Cash,5,Sunday
3,487313402,2018-01-22,13:38,Female,Park lane,Dallas,Yes,Sporting,89.0,4.0,356.0,Gpay,1,Monday
4,197763430,2018-02-18,15:31,Female,Park lane,Dallas,No,Books,82.0,5.0,410.0,Cash,4,Sunday